const app = document.getElementById("root");



function res_1(){
    function App(){
        return(<div className="react_1">
            <p>Дання процедура поможет вам :<br/>
		- Выявить текущие поломки авто <br />
		- Диагностика и определение неисправностей посредством специального оборудования и программного обеспечения. <br />
		- Определить состояние систем и компонентов<br />
		- Предотвратить возможные поломки и повреждения автомобиля<br />
        <br />
	Кроме того, проведение диагностики авто является неотъемлемой частью технического обслуживания.</p>
        </div>)
    }
    ReactDOM.render(App(),app)
}
function res_2(){
    function App(){
        return(<div className="react_1">
            <p>Своевременное обслуживание кондиционера:<br />
            
	- Обеспечивает комфортные условия в салоне авто<br />
	- Поддерживает работоспособность системы<br />
	- Выявляет поломки на раних стадиях<br />
    <br />
	В целом, регулярное обслуживание кондиционера в автомобиле помогает поддерживать его работоспособность,
     обеспечить комфортные условия в салоне</p>
        </div>)
    }
    ReactDOM.render(App(),app)
}
function res_3(){
    function App(){
        return(<div className="react_1">
            <p>Основные причины, по которым форсунки требуют чистки, включают:<br />
            - В процессе работы автомобиля в форсунках может накапливаться грязь, отложения и сажа из топлива<br />
            - Если форсунки не очищаются вовремя, на них могут образовываться прочные отложения, которые могут быть трудно удалить обычными методами<br />
            <br />
            Обычно чистку форсунок рекомендуется проводить регулярно в соответствии с рекомендациями производителя автомобиля или при появлении проблем с работой двигателя.
            </p>
        </div>)
    }
    ReactDOM.render(App(),app)
}
function res_4(){
    function App(){
        return(<div className="react_1">
            
            <p>Чип тюнинг– это изменение программы управления двигателем ради повышения мощности, <br />
            
            экономичности или исправления ошибок. Работой двигателя управляет ЭБУ – электронный блок <br />
            управления, который поддается перепрограммированию (в аналогии с компьютерами – это <br />
            переустановка операционной системы).</p>
        </div>)
    }
    ReactDOM.render(App(),app)
}
